Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1024/src/hardware_init_MIMXRT1024.c
    return status;
}
#endif // #if BL_FEATURE_FLEXSPI_NOR_MODULE || BL_FEATURE_SPINAND_MODULE

void dummy_byte_callback(uint8_t byte)
{
    (void)byte;
}

void debug_init(void) {}

#if __ICCARM__

size_t __write(int handle, const unsigned char *buf, size_t size)
{
    return size;
}

#endif // __ICCARM__

void update_available_peripherals() {}

void init_hardware(void)
{
    CLOCK_EnableClock(kCLOCK_UsbOh3);
}

void deinit_hardware(void)
{
    CLOCK_DisableClock(kCLOCK_UsbOh3);
}

//!@brief Write FlexSPI persistent content
status_t flexspi_nor_write_persistent(const uint32_t data)
{
    SRC->GPR[2] = data;

    return kStatus_Success;
}
//!@brief Read FlexSPI persistent content
status_t flexspi_nor_read_persistent(uint32_t *data)
{
    *data = SRC->GPR[2];

    return kStatus_Success;
}

//!@brief Get the hab status.
habstatus_option_t get_hab_status(void)
{
    if (ROM_OCOTP_SEC_CONFIG_VALUE() & 0x2)
    {
        return kHabStatus_Close;
    }
    else
    {
        return kHabStatus_Open;
    }
}

void flexspi_update_padsetting(flexspi_mem_config_t *config, uint32_t driveStrength)
{
#define IOMUXC_PAD_SETTING_DSE_SHIFT (3)
#define IOMUXC_PAD_SETTING_DSE_MASK (0x07 << IOMUXC_PAD_SETTING_DSE_SHIFT)
#define IOMUXC_PAD_SETTING_DSE(x) (((x) << IOMUXC_PAD_SETTING_DSE_SHIFT) & IOMUXC_PAD_SETTING_DSE_MASK)
    if (driveStrength)
    {
        config->controllerMiscOption |= FLEXSPI_BITMASK(kFlexSpiMiscOffset_PadSettingOverrideEnable);
        config->dqsPadSettingOverride =
            (FLEXSPI_DQS_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        config->sclkPadSettingOverride =
            (FLEXSPI_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
        config->dataPadSettingOverride =
            (FLEXSPI_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);

        config->csPadSettingOverride =
            (FLEXSPI_DQS_SW_PAD_CTL_VAL & ~IOMUXC_PAD_SETTING_DSE_MASK) | IOMUXC_PAD_SETTING_DSE(driveStrength);
    }
}

void normal_mem_init(void)
{
    typedef struct
    {
        uint32_t dtcmSizeKB;
        uint32_t itcmSizeKB;
        uint32_t ocramSizeKB;
    } flexram_cfg_t;

    const flexram_cfg_t k_flexramCfgList[] = {
        { 64, 64, 128 }, { 128, 64, 64 }, { 128, 0, 128 },  { 128, 32, 96 }, { 64, 128, 64 }, { 192, 0, 64 },
        { 64, 32, 160 }, { 64, 0, 192 },  { 256, 64, 192 }, { 32, 64, 160 }, { 32, 128, 96 }, { 32, 160, 64 },
        { 0, 128, 128 }, { 32, 32, 192 }, { 0, 192, 64 },   { 0, 0, 256 },
    };

    uint32_t ramCfgIndex = ROM_OCOTP_FLEXRAM_CFG_VALUE();

    uint32_t itcmSize = k_flexramCfgList[ramCfgIndex].itcmSizeKB * 1024u;
    uint32_t dtcmSize = k_flexramCfgList[ramCfgIndex].dtcmSizeKB * 1024u;
    uint32_t ocramSize = k_flexramCfgList[ramCfgIndex].ocramSizeKB * 1024u;

    if (itcmSize < 1)
    {
        itcmSize = 1;
    }
    if (dtcmSize < 1)
    {
        dtcmSize = 1;
    }
    if (ocramSize < 1)
    {
        ocramSize = 1;
    }

    g_memoryMap[0].startAddress = 0;
    g_memoryMap[0].endAddress = g_memoryMap[0].startAddress + itcmSize - 1;
    g_memoryMap[1].startAddress = 0x20000000;
    g_memoryMap[1].endAddress = g_memoryMap[1].startAddress + dtcmSize - 1;
    g_memoryMap[2].startAddress = 0x20200000;
    g_memoryMap[2].endAddress = g_memoryMap[2].startAddress + ocramSize - 1;
}

status_t target_load_bootloader_config_area(bootloader_configuration_data_t *config)
{
    memcpy(config, (void *)kBootloaderConfigAreaAddress, sizeof(bootloader_configuration_data_t));

    return kStatus_Success;
}

__USED const uint32_t g_reliableUpdateAPI = 0;

////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
